Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkTagAttributes Constructor (SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide, TagLocation, Vector, SectionMarkBase.SectionMarkTagAttributes.TagTextRotation, ContainerElement)
 Creates a new section mark tag attributes instance with the given information.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SectionMarkTagAttributes(
	SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide showOnSide,
	TagLocation location,
	Vector offset,
	SectionMarkBase.SectionMarkTagAttributes.TagTextRotation rotation,
	ContainerElement tagContent
)
Public Sub New (
	showOnSide As SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide,
	location As TagLocation,
	offset As Vector,
	rotation As SectionMarkBase.SectionMarkTagAttributes.TagTextRotation,
	tagContent As ContainerElement
)
Parameters
showOnSide
Type: Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide
The side(s) on which to show the tag to be used.
location
Type: Tekla.Structures.Drawing.TagLocation
The location of the mark tag to be used.
offset
Type: Tekla.Structures.Geometry3d.Vector
The offset of the mark tag to be used.
rotation
Type: Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagTextRotation
The policy for text rotation of the mark tag to be used.
tagContent
Type: Tekla.Structures.Drawing.ContainerElement
The content of the mark tag to be used.
See Also
Reference
SectionMarkBase.SectionMarkTagAttributes Class
SectionMarkBase.SectionMarkTagAttributes Overload
Tekla.Structures.Drawing Namespace